GopalSaraf/Practicals/PSDL/include/proc/pic16f18056.inc
// Register: LATA
#define LATA LATA
LATA                                     equ 0018h
// bitfield definitions
LATA_LATA0_POSN                          equ 0000h
LATA_LATA0_POSITION                      equ 0000h
LATA_LATA0_SIZE                          equ 0001h
LATA_LATA0_LENGTH                        equ 0001h
LATA_LATA0_MASK                          equ 0001h
LATA_LATA1_POSN                          equ 0001h
LATA_LATA1_POSITION                      equ 0001h
LATA_LATA1_SIZE                          equ 0001h
LATA_LATA1_LENGTH                        equ 0001h
LATA_LATA1_MASK                          equ 0002h
LATA_LATA2_POSN                          equ 0002h
LATA_LATA2_POSITION                      equ 0002h
LATA_LATA2_SIZE                          equ 0001h
LATA_LATA2_LENGTH                        equ 0001h
LATA_LATA2_MASK                          equ 0004h
LATA_LATA3_POSN                          equ 0003h
LATA_LATA3_POSITION                      equ 0003h
LATA_LATA3_SIZE                          equ 0001h
LATA_LATA3_LENGTH                        equ 0001h
LATA_LATA3_MASK                          equ 0008h
LATA_LATA4_POSN                          equ 0004h
LATA_LATA4_POSITION                      equ 0004h
LATA_LATA4_SIZE                          equ 0001h
LATA_LATA4_LENGTH                        equ 0001h
LATA_LATA4_MASK                          equ 0010h
LATA_LATA5_POSN                          equ 0005h
LATA_LATA5_POSITION                      equ 0005h
LATA_LATA5_SIZE                          equ 0001h
LATA_LATA5_LENGTH                        equ 0001h
LATA_LATA5_MASK                          equ 0020h
LATA_LATA6_POSN                          equ 0006h
LATA_LATA6_POSITION                      equ 0006h
LATA_LATA6_SIZE                          equ 0001h
LATA_LATA6_LENGTH                        equ 0001h
LATA_LATA6_MASK                          equ 0040h
LATA_LATA7_POSN                          equ 0007h
LATA_LATA7_POSITION                      equ 0007h
LATA_LATA7_SIZE                          equ 0001h
LATA_LATA7_LENGTH                        equ 0001h
LATA_LATA7_MASK                          equ 0080h

// Register: LATB
#define LATB LATB
LATB                                     equ 0019h
// bitfield definitions
LATB_LATB0_POSN                          equ 0000h
LATB_LATB0_POSITION                      equ 0000h
LATB_LATB0_SIZE                          equ 0001h
LATB_LATB0_LENGTH                        equ 0001h
LATB_LATB0_MASK                          equ 0001h
LATB_LATB1_POSN                          equ 0001h
LATB_LATB1_POSITION                      equ 0001h
LATB_LATB1_SIZE                          equ 0001h
LATB_LATB1_LENGTH                        equ 0001h
LATB_LATB1_MASK                          equ 0002h
LATB_LATB2_POSN                          equ 0002h
LATB_LATB2_POSITION                      equ 0002h
LATB_LATB2_SIZE                          equ 0001h
LATB_LATB2_LENGTH                        equ 0001h
LATB_LATB2_MASK                          equ 0004h
LATB_LATB3_POSN                          equ 0003h
LATB_LATB3_POSITION                      equ 0003h
LATB_LATB3_SIZE                          equ 0001h
LATB_LATB3_LENGTH                        equ 0001h
LATB_LATB3_MASK                          equ 0008h
LATB_LATB4_POSN                          equ 0004h
LATB_LATB4_POSITION                      equ 0004h
LATB_LATB4_SIZE                          equ 0001h
LATB_LATB4_LENGTH                        equ 0001h
LATB_LATB4_MASK                          equ 0010h
LATB_LATB5_POSN                          equ 0005h
LATB_LATB5_POSITION                      equ 0005h
LATB_LATB5_SIZE                          equ 0001h
LATB_LATB5_LENGTH                        equ 0001h
LATB_LATB5_MASK                          equ 0020h
LATB_LATB6_POSN                          equ 0006h
LATB_LATB6_POSITION                      equ 0006h
LATB_LATB6_SIZE                          equ 0001h
LATB_LATB6_LENGTH                        equ 0001h
LATB_LATB6_MASK                          equ 0040h
LATB_LATB7_POSN                          equ 0007h
LATB_LATB7_POSITION                      equ 0007h
LATB_LATB7_SIZE                          equ 0001h
LATB_LATB7_LENGTH                        equ 0001h
LATB_LATB7_MASK                          equ 0080h

// Register: LATC
#define LATC LATC
LATC                                     equ 001Ah
// bitfield definitions
LATC_LATC0_POSN                          equ 0000h
LATC_LATC0_POSITION                      equ 0000h
LATC_LATC0_SIZE                          equ 0001h
LATC_LATC0_LENGTH                        equ 0001h
LATC_LATC0_MASK                          equ 0001h
LATC_LATC1_POSN                          equ 0001h
LATC_LATC1_POSITION                      equ 0001h
LATC_LATC1_SIZE                          equ 0001h
LATC_LATC1_LENGTH                        equ 0001h
LATC_LATC1_MASK                          equ 0002h
LATC_LATC2_POSN                          equ 0002h
LATC_LATC2_POSITION                      equ 0002h
LATC_LATC2_SIZE                          equ 0001h
LATC_LATC2_LENGTH                        equ 0001h
LATC_LATC2_MASK                          equ 0004h
LATC_LATC3_POSN                          equ 0003h
LATC_LATC3_POSITION                      equ 0003h
LATC_LATC3_SIZE                          equ 0001h
LATC_LATC3_LENGTH                        equ 0001h
LATC_LATC3_MASK                          equ 0008h
LATC_LATC4_POSN                          equ 0004h
LATC_LATC4_POSITION                      equ 0004h
LATC_LATC4_SIZE                          equ 0001h
LATC_LATC4_LENGTH                        equ 0001h
LATC_LATC4_MASK                          equ 0010h
LATC_LATC5_POSN                          equ 0005h
LATC_LATC5_POSITION                      equ 0005h
LATC_LATC5_SIZE                          equ 0001h
LATC_LATC5_LENGTH                        equ 0001h
LATC_LATC5_MASK                          equ 0020h
LATC_LATC6_POSN                          equ 0006h
LATC_LATC6_POSITION                      equ 0006h
LATC_LATC6_SIZE                          equ 0001h
LATC_LATC6_LENGTH                        equ 0001h
LATC_LATC6_MASK                          equ 0040h
LATC_LATC7_POSN                          equ 0007h
LATC_LATC7_POSITION                      equ 0007h
LATC_LATC7_SIZE                          equ 0001h
LATC_LATC7_LENGTH                        equ 0001h
LATC_LATC7_MASK                          equ 0080h

// Register: LATE
#define LATE LATE
LATE                                     equ 001Ch
// bitfield definitions
LATE_LATE3_POSN                          equ 0003h
LATE_LATE3_POSITION                      equ 0003h
LATE_LATE3_SIZE                          equ 0001h
LATE_LATE3_LENGTH                        equ 0001h
LATE_LATE3_MASK                          equ 0008h

// Register: PIR0
#define PIR0 PIR0
PIR0                                     equ 008Ch
// bitfield definitions
PIR0_INTF_POSN                           equ 0000h
PIR0_INTF_POSITION                       equ 0000h
PIR0_INTF_SIZE                           equ 0001h
PIR0_INTF_LENGTH                         equ 0001h
PIR0_INTF_MASK                           equ 0001h
PIR0_IOCIF_POSN                          equ 0004h
PIR0_IOCIF_POSITION                      equ 0004h
PIR0_IOCIF_SIZE                          equ 0001h
PIR0_IOCIF_LENGTH                        equ 0001h
PIR0_IOCIF_MASK                          equ 0010h
PIR0_TMR0IF_POSN                         equ 0005h
PIR0_TMR0IF_POSITION                     equ 0005h
PIR0_TMR0IF_SIZE                         equ 0001h
PIR0_TMR0IF_LENGTH                       equ 0001h
PIR0_TMR0IF_MASK                         equ 0020h

// Register: PIR1
#define PIR1 PIR1
PIR1                                     equ 008Dh
// bitfield definitions
PIR1_NVMIF_POSN                          equ 0000h
PIR1_NVMIF_POSITION                      equ 0000h
PIR1_NVMIF_SIZE                          equ 0001h
PIR1_NVMIF_LENGTH                        equ 0001h
PIR1_NVMIF_MASK                          equ 0001h
PIR1_ACTIF_POSN                          equ 0002h
PIR1_ACTIF_POSITION                      equ 0002h
PIR1_ACTIF_SIZE                          equ 0001h
PIR1_ACTIF_LENGTH                        equ 0001h
PIR1_ACTIF_MASK                          equ 0004h
PIR1_TMR1IF_POSN                         equ 0003h
PIR1_TMR1IF_POSITION                     equ 0003h
PIR1_TMR1IF_SIZE                         equ 0001h
PIR1_TMR1IF_LENGTH                       equ 0001h
PIR1_TMR1IF_MASK                         equ 0008h
PIR1_TMR1GIF_POSN                        equ 0004h
PIR1_TMR1GIF_POSITION                    equ 0004h
PIR1_TMR1GIF_SIZE                        equ 0001h
PIR1_TMR1GIF_LENGTH                      equ 0001h
PIR1_TMR1GIF_MASK                        equ 0010h
PIR1_TMR3IF_POSN                         equ 0005h
PIR1_TMR3IF_POSITION                     equ 0005h
PIR1_TMR3IF_SIZE                         equ 0001h
PIR1_TMR3IF_LENGTH                       equ 0001h
PIR1_TMR3IF_MASK                         equ 0020h
PIR1_TMR3GIF_POSN                        equ 0006h
PIR1_TMR3GIF_POSITION                    equ 0006h
PIR1_TMR3GIF_SIZE                        equ 0001h
PIR1_TMR3GIF_LENGTH                      equ 0001h
PIR1_TMR3GIF_MASK                        equ 0040h
PIR1_TMR2IF_POSN                         equ 0007h
PIR1_TMR2IF_POSITION                     equ 0007h
PIR1_TMR2IF_SIZE                         equ 0001h
PIR1_TMR2IF_LENGTH                       equ 0001h
PIR1_TMR2IF_MASK                         equ 0080h

// Register: PIR2
#define PIR2 PIR2
PIR2                                     equ 008Eh
// bitfield definitions
PIR2_TMR4IF_POSN                         equ 0000h
PIR2_TMR4IF_POSITION                     equ 0000h
PIR2_TMR4IF_SIZE                         equ 0001h
PIR2_TMR4IF_LENGTH                       equ 0001h
PIR2_TMR4IF_MASK                         equ 0001h
PIR2_TMR6IF_POSN                         equ 0001h
PIR2_TMR6IF_POSITION                     equ 0001h
PIR2_TMR6IF_SIZE                         equ 0001h
PIR2_TMR6IF_LENGTH                       equ 0001h
PIR2_TMR6IF_MASK                         equ 0002h
PIR2_CCP1IF_POSN                         equ 0002h
PIR2_CCP1IF_POSITION                     equ 0002h
PIR2_CCP1IF_SIZE                         equ 0001h
PIR2_CCP1IF_LENGTH                       equ 0001h
PIR2_CCP1IF_MASK                         equ 0004h
PIR2_CCP2IF_POSN                         equ 0003h
PIR2_CCP2IF_POSITION                     equ 0003h
PIR2_CCP2IF_SIZE                         equ 0001h
PIR2_CCP2IF_LENGTH                       equ 0001h
PIR2_CCP2IF_MASK                         equ 0008h
PIR2_NCO1IF_POSN                         equ 0004h
PIR2_NCO1IF_POSITION                     equ 0004h
PIR2_NCO1IF_SIZE                         equ 0001h
PIR2_NCO1IF_LENGTH                       equ 0001h
PIR2_NCO1IF_MASK                         equ 0010h
PIR2_CWG1IF_POSN                         equ 0005h
PIR2_CWG1IF_POSITION                     equ 0005h
PIR2_CWG1IF_SIZE                         equ 0001h
PIR2_CWG1IF_LENGTH                       equ 0001h
PIR2_CWG1IF_MASK                         equ 0020h
PIR2_CLC1IF_POSN                         equ 0006h
PIR2_CLC1IF_POSITION                     equ 0006h
PIR2_CLC1IF_SIZE                         equ 0001h
PIR2_CLC1IF_LENGTH                       equ 0001h
PIR2_CLC1IF_MASK                         equ 0040h
PIR2_CLC2IF_POSN                         equ 0007h
PIR2_CLC2IF_POSITION                     equ 0007h
PIR2_CLC2IF_SIZE                         equ 0001h
PIR2_CLC2IF_LENGTH                       equ 0001h
PIR2_CLC2IF_MASK                         equ 0080h

// Register: PIR3
#define PIR3 PIR3
PIR3                                     equ 008Fh
// bitfield definitions
PIR3_CLC3IF_POSN                         equ 0000h
PIR3_CLC3IF_POSITION                     equ 0000h
PIR3_CLC3IF_SIZE                         equ 0001h
PIR3_CLC3IF_LENGTH                       equ 0001h
PIR3_CLC3IF_MASK                         equ 0001h
PIR3_CLC4IF_POSN                         equ 0001h
PIR3_CLC4IF_POSITION                     equ 0001h
PIR3_CLC4IF_SIZE                         equ 0001h
PIR3_CLC4IF_LENGTH                       equ 0001h
PIR3_CLC4IF_MASK                         equ 0002h
PIR3_TX1IF_POSN                          equ 0002h
PIR3_TX1IF_POSITION                      equ 0002h
PIR3_TX1IF_SIZE                          equ 0001h
PIR3_TX1IF_LENGTH                        equ 0001h
PIR3_TX1IF_MASK                          equ 0004h
PIR3_RC1IF_POSN                          equ 0003h
PIR3_RC1IF_POSITION                      equ 0003h
PIR3_RC1IF_SIZE                          equ 0001h
PIR3_RC1IF_LENGTH                        equ 0001h
PIR3_RC1IF_MASK                          equ 0008h
PIR3_TX2IF_POSN                          equ 0004h
PIR3_TX2IF_POSITION                      equ 0004h
PIR3_TX2IF_SIZE                          equ 0001h
PIR3_TX2IF_LENGTH                        equ 0001h
PIR3_TX2IF_MASK                          equ 0010h
PIR3_RC2IF_POSN                          equ 0005h
PIR3_RC2IF_POSITION                      equ 0005h
PIR3_RC2IF_SIZE                          equ 0001h
PIR3_RC2IF_LENGTH                        equ 0001h
PIR3_RC2IF_MASK                          equ 0020h
PIR3_SSP1IF_POSN                         equ 0006h
PIR3_SSP1IF_POSITION                     equ 0006h
PIR3_SSP1IF_SIZE                         equ 0001h
PIR3_SSP1IF_LENGTH                       equ 0001h
PIR3_SSP1IF_MASK                         equ 0040h
PIR3_BCL1IF_POSN                         equ 0007h
PIR3_BCL1IF_POSITION                     equ 0007h
PIR3_BCL1IF_SIZE                         equ 0001h
PIR3_BCL1IF_LENGTH                       equ 0001h
PIR3_BCL1IF_MASK                         equ 0080h

// Register: PIR4
#define PIR4 PIR4
PIR4                                     equ 0090h
// bitfield definitions
PIR4_SSP2IF_POSN                         equ 0000h
PIR4_SSP2IF_POSITION                     equ 0000h
PIR4_SSP2IF_SIZE                         equ 0001h
PIR4_SSP2IF_LENGTH                       equ 0001h
PIR4_SSP2IF_MASK                         equ 0001h
PIR4_BCL2IF_POSN                         equ 0001h
PIR4_BCL2IF_POSITION                     equ 0001h
PIR4_BCL2IF_SIZE                         equ 0001h
PIR4_BCL2IF_LENGTH                       equ 0001h
PIR4_BCL2IF_MASK                         equ 0002h
PIR4_CM1IF_POSN                          equ 0002h
PIR4_CM1IF_POSITION                      equ 0002h
PIR4_CM1IF_SIZE                          equ 0001h
PIR4_CM1IF_LENGTH                        equ 0001h
PIR4_CM1IF_MASK                          equ 0004h
PIR4_ADIF_POSN                           equ 0003h
PIR4_ADIF_POSITION                       equ 0003h
PIR4_ADIF_SIZE                           equ 0001h
PIR4_ADIF_LENGTH                         equ 0001h
PIR4_ADIF_MASK                           equ 0008h
PIR4_ADTIF_POSN                          equ 0004h
PIR4_ADTIF_POSITION                      equ 0004h
PIR4_ADTIF_SIZE                          equ 0001h
PIR4_ADTIF_LENGTH                        equ 0001h
PIR4_ADTIF_MASK                          equ 0010h
PIR4_ZCDIF_POSN                          equ 0005h
PIR4_ZCDIF_POSITION                      equ 0005h
PIR4_ZCDIF_SIZE                          equ 0001h
PIR4_ZCDIF_LENGTH                        equ 0001h
PIR4_ZCDIF_MASK                          equ 0020h

// Register: PIE0
#define PIE0 PIE0
PIE0                                     equ 0096h
// bitfield definitions
PIE0_INTE_POSN                           equ 0000h
PIE0_INTE_POSITION                       equ 0000h
PIE0_INTE_SIZE                           equ 0001h
PIE0_INTE_LENGTH                         equ 0001h
PIE0_INTE_MASK                           equ 0001h
PIE0_IOCIE_POSN                          equ 0004h
PIE0_IOCIE_POSITION                      equ 0004h
PIE0_IOCIE_SIZE                          equ 0001h
PIE0_IOCIE_LENGTH                        equ 0001h
PIE0_IOCIE_MASK                          equ 0010h
PIE0_TMR0IE_POSN                         equ 0005h
PIE0_TMR0IE_POSITION                     equ 0005h
PIE0_TMR0IE_SIZE                         equ 0001h
PIE0_TMR0IE_LENGTH                       equ 0001h
PIE0_TMR0IE_MASK                         equ 0020h

// Register: PIE1
#define PIE1 PIE1
PIE1                                     equ 0097h
// bitfield definitions
PIE1_NVMIE_POSN                          equ 0000h
PIE1_NVMIE_POSITION                      equ 0000h
PIE1_NVMIE_SIZE                          equ 0001h
PIE1_NVMIE_LENGTH                        equ 0001h
PIE1_NVMIE_MASK                          equ 0001h
PIE1_ACTIE_POSN                          equ 0002h
PIE1_ACTIE_POSITION                      equ 0002h
PIE1_ACTIE_SIZE                          equ 0001h
PIE1_ACTIE_LENGTH                        equ 0001h
PIE1_ACTIE_MASK                          equ 0004h
PIE1_TMR1IE_POSN                         equ 0003h
PIE1_TMR1IE_POSITION                     equ 0003h
PIE1_TMR1IE_SIZE                         equ 0001h
PIE1_TMR1IE_LENGTH                       equ 0001h
PIE1_TMR1IE_MASK                         equ 0008h
PIE1_TMR1GIE_POSN                        equ 0004h
PIE1_TMR1GIE_POSITION                    equ 0004h
PIE1_TMR1GIE_SIZE                        equ 0001h
PIE1_TMR1GIE_LENGTH                      equ 0001h
PIE1_TMR1GIE_MASK                        equ 0010h
PIE1_TMR3IE_POSN                         equ 0005h
PIE1_TMR3IE_POSITION                     equ 0005h
PIE1_TMR3IE_SIZE                         equ 0001h
PIE1_TMR3IE_LENGTH                       equ 0001h
PIE1_TMR3IE_MASK                         equ 0020h
PIE1_TMR3GIE_POSN                        equ 0006h
PIE1_TMR3GIE_POSITION                    equ 0006h
PIE1_TMR3GIE_SIZE                        equ 0001h
PIE1_TMR3GIE_LENGTH                      equ 0001h
PIE1_TMR3GIE_MASK                        equ 0040h
PIE1_TMR2IE_POSN                         equ 0007h
PIE1_TMR2IE_POSITION                     equ 0007h
PIE1_TMR2IE_SIZE                         equ 0001h
PIE1_TMR2IE_LENGTH                       equ 0001h
PIE1_TMR2IE_MASK                         equ 0080h

// Register: PIE2
#define PIE2 PIE2
PIE2                                     equ 0098h
// bitfield definitions
PIE2_TMR4IE_POSN                         equ 0000h
PIE2_TMR4IE_POSITION                     equ 0000h
PIE2_TMR4IE_SIZE                         equ 0001h
PIE2_TMR4IE_LENGTH                       equ 0001h
PIE2_TMR4IE_MASK                         equ 0001h
PIE2_TMR6IE_POSN                         equ 0001h
PIE2_TMR6IE_POSITION                     equ 0001h
PIE2_TMR6IE_SIZE                         equ 0001h
PIE2_TMR6IE_LENGTH                       equ 0001h
PIE2_TMR6IE_MASK                         equ 0002h
PIE2_CCP1IE_POSN                         equ 0002h
PIE2_CCP1IE_POSITION                     equ 0002h
PIE2_CCP1IE_SIZE                         equ 0001h
PIE2_CCP1IE_LENGTH                       equ 0001h
PIE2_CCP1IE_MASK                         equ 0004h
PIE2_CCP2IE_POSN                         equ 0003h
PIE2_CCP2IE_POSITION                     equ 0003h
PIE2_CCP2IE_SIZE                         equ 0001h
PIE2_CCP2IE_LENGTH                       equ 0001h
PIE2_CCP2IE_MASK                         equ 0008h
PIE2_NCO1IE_POSN                         equ 0004h
PIE2_NCO1IE_POSITION                     equ 0004h
PIE2_NCO1IE_SIZE                         equ 0001h
PIE2_NCO1IE_LENGTH                       equ 0001h
PIE2_NCO1IE_MASK                         equ 0010h
PIE2_CWG1IE_POSN                         equ 0005h
PIE2_CWG1IE_POSITION                     equ 0005h
PIE2_CWG1IE_SIZE                         equ 0001h
PIE2_CWG1IE_LENGTH                       equ 0001h
PIE2_CWG1IE_MASK                         equ 0020h
PIE2_CLC1IE_POSN                         equ 0006h
PIE2_CLC1IE_POSITION                     equ 0006h
PIE2_CLC1IE_SIZE                         equ 0001h
PIE2_CLC1IE_LENGTH                       equ 0001h
PIE2_CLC1IE_MASK                         equ 0040h
PIE2_CLC2IE_POSN                         equ 0007h
PIE2_CLC2IE_POSITION                     equ 0007h
PIE2_CLC2IE_SIZE                         equ 0001h
PIE2_CLC2IE_LENGTH                       equ 0001h
PIE2_CLC2IE_MASK                         equ 0080h

// Register: PIE3
#define PIE3 PIE3
PIE3                                     equ 0099h
// bitfield definitions
PIE3_CLC3IE_POSN                         equ 0000h
PIE3_CLC3IE_POSITION                     equ 0000h
PIE3_CLC3IE_SIZE                         equ 0001h
PIE3_CLC3IE_LENGTH                       equ 0001h
PIE3_CLC3IE_MASK                         equ 0001h
PIE3_CLC4IE_POSN                         equ 0001h
PIE3_CLC4IE_POSITION                     equ 0001h
PIE3_CLC4IE_SIZE                         equ 0001h
PIE3_CLC4IE_LENGTH                       equ 0001h
PIE3_CLC4IE_MASK                         equ 0002h
PIE3_TX1IE_POSN                          equ 0002h
PIE3_TX1IE_POSITION                      equ 0002h
PIE3_TX1IE_SIZE                          equ 0001h
PIE3_TX1IE_LENGTH                        equ 0001h
PIE3_TX1IE_MASK                          equ 0004h
PIE3_RC1IE_POSN                          equ 0003h
PIE3_RC1IE_POSITION                      equ 0003h
PIE3_RC1IE_SIZE                          equ 0001h
PIE3_RC1IE_LENGTH                        equ 0001h
PIE3_RC1IE_MASK                          equ 0008h
PIE3_TX2IE_POSN                          equ 0004h
PIE3_TX2IE_POSITION                      equ 0004h
PIE3_TX2IE_SIZE                          equ 0001h
PIE3_TX2IE_LENGTH                        equ 0001h
PIE3_TX2IE_MASK                          equ 0010h
PIE3_RC2IE_POSN                          equ 0005h
PIE3_RC2IE_POSITION                      equ 0005h
PIE3_RC2IE_SIZE                          equ 0001h
PIE3_RC2IE_LENGTH                        equ 0001h
PIE3_RC2IE_MASK                          equ 0020h
PIE3_SSP1IE_POSN                         equ 0006h
PIE3_SSP1IE_POSITION                     equ 0006h
PIE3_SSP1IE_SIZE                         equ 0001h
PIE3_SSP1IE_LENGTH                       equ 0001h
PIE3_SSP1IE_MASK                         equ 0040h
PIE3_BCL1IE_POSN                         equ 0007h
PIE3_BCL1IE_POSITION                     equ 0007h
PIE3_BCL1IE_SIZE                         equ 0001h
PIE3_BCL1IE_LENGTH                       equ 0001h
PIE3_BCL1IE_MASK                         equ 0080h

